{"사용자 모드": "메인 메모리의 한 부분인 사용자 프로그램이 탑재되는 사용자 공간의 프로그램을 수행할 때의 모드입니다.", "실행시점결속": "논리주소인채로적재한후MMU를통해물리주소를확정하는것이다.", "논리주소": "실행중인프로그램관점에서의논리적주소이다.", "시스템 호출": "커널의 형태적 측면에 있어서 응용 프로그램과 커널이 만나는 곳을 시스템 호출이라 합니다. 커널 API라고도 부르기도 합니다.", "내부단편화": "필요이상의메모리가할당되어메모리공간이낭비되는상황이다.", "캐시": "CPU내의 레지스터와 메인 메모리 사이에 접근속도 또는 전송량의 심한 격차를 완화시켜 줍니다. 이를 위해서 레지스터와 메인메모리 사이에 캐시를 위치시킨 후 CPU에서 메인메모리에 접근시 그 자료를 캐시에 복사해 놓고, 다음번 접근시에 캐시를 먼저 방문하여 찾는 자료가 있으면 캐시에서 갖고 가고, 없으면 메인메모리까지 가서 가져옵니다.", "세그먼테이션": "가변크기를가진자료구조들의집합을말한다.", "마이크로 커널": "마이크로 커널은 프로세스간 통신, 메모리관리, 클럭인터럽트 처리와 CPU 스캐줄링 등 아주 핵심기능만을 커널에 포함시키고 나머지는 서버 형태로 두어 사용자 모드의 프로세스로 수행시킵니다. 따라서 응용 프로그램으로부터 파일 입출력이나 장치 입출력을 위하여 시스템 콜이 들어오면 프로세스간 통신을 통해 다른 다른 프로세스 즉, 파일 시스템 서버나 디바이스 드라이버 수행 프로세스로 메시지를 보내주는 형태입니다", "상태레지스터": "현재 해당 장치에 오류가 있는지, 또는 작업이 진행 중에 있는지, 작업을 끝내고 쉬고 있는지 등 장치의 상태를 체크해 보는 용도로 사용됩니다.", "물리주소": "프로그램이실제로탑재된메인메모리의주소이다.", "커널": "운영체제의 핵심부분으로서 부팅 이후 메모리에 상주하는 부분입니다.", "격리형 입출력 방식": "격리형 입출력 방식은 입출력 장치가 메모리와는 별도의 주소공간을 가지는 방식으로 입출력 맵형 입출력 즉 I/O mapped I/O라고도 합니다. 이 방식은 메모리 주소지정을 위하여 사용하는 주소 버스와는 별도로 I/O 장치를 위한 주소라인을 따로 사용하기 때문에, 주소값이 메모리 주소인지 입출력장치 주소인지를 구별하는 제어라인을 따로 사용하는 하드웨어 구조를 전제로 하는 방식입니다. ", "단편화": "메모리공간이작게나뉘어져공간은있지만사용이불가능한상태이다.", "비동기식 호출": "넌블록킹콜이라고도 합니다. 요청한 시스템 콜이 종료될 때 이벤트가 전달되어 오는데, 이 이벤트를 처리할 함수를 인자로 미리 알려 놓는 것입니다. 이를 콜백함수라고 하는데, 콜백함수는 전달되어온 데이터를 응용 프로그램의 일정 자료구조에 저장을 하거나 직접 처리를 진행하게 됩니다.", "커널 모드": "메인 메모리의 한 부분인 커널 프로그램이 탑재되는 커널 공간의 프로그램을 수행할 때의 모드입니다.", "인터럽트 마스크": "두 바이트로 각 비트가 지정되는데 인터럽트의 우선순위를 비교하는 것입니다.", "이중모드": "이중모드란 커널모드와 사용자모드를 분리하는 것을 이야기 하는 것인데요. 기본적으로 메인메모리를 사용자 프로그램이 탑재되는 사용자 공간과 커널 프로그램이 탑재되는 커널공간으로 나누고 CPU가 사용자공간의 프로그램을 수행할 때는 사용자 모드로 수행하도록하고 커널 공간의 프로그램을 수행할 때에는 반드시 커널 모드로만 수행하도록 하는 겁니다.", "Hit Ratio": "찾는 데이터가 캐시에 있을 확률을 말합니다. Hit Ratio가 높을 수록 캐시를 사용하는 효과가 증가합니다.", "적재시점결속": "프로그램이메인메모리에적재될때물리적주소로변환하는것이다.", "MMU": "하드웨어장치메모리관리장치이다.", "DMA 방식": "Direct Memory Access 방식은 말그대로 입출력 장치가 CPU의 도움없이 독자적으로 메모리에 접근하도록 하여 한 입출력 명령으로 블록 단위의 입출력이 가능하도록 하는 방식입니다.", "보호": "본 강의에서는 영어로 protection을 의미합니다. 즉, 소프트웨어로 만들어진 커널이 응용프로그램에 의하여 문제가 발생하는 경우가 있는데 어떻게 이를 하드웨어의 도움을 받아 protect할 수 있는지에 대하여 살펴보도록 하겠습니다.", "메모리 사상형 입출력 방식": "메모리 사상형 입출력 방식 즉 Memory mapped IO 방식은 메모리 주소 지정을 위한 주소버스와 입출력 제어 라인을 공유하고, 주소버스에 실린 값으로 메모리 주소와 입출력 주소를 구별하는 하드웨어 구조 상의 특징을 전제로 하는 방식입니다. 따라서, 메모리에 할당된 주소의 일부를 장치제어기의 레지스터를 접근하는 주소로 사용하는 방식입니다.", "Fast Interrupt": "특별히 빠른 처리 혹은 빠른 반응을 위해 인터럽트 핸들러 즉 ISR에서 다른 인터럽트 처리를 disable시키고 짧은 시간에 처리를 마무리하는 것을 말합니다.  물론 이 fast interrupt 처리를 너무 많이 하면 시스템 전체의 반응성을 떨어뜨리기 때문에 특별한 경우에만 사용해야 하는데요 예를 들면 타임 크리티컬한 측면이 있는 클럭 인터럽트가 그 예가 되겠습니다. ", "시스템 프로그램": "시스템 프로그램이란 커널 이외의 프로그램으로써 운영체제 개발자가 기본적으로 제공하는 라이브러리나 운영체제 사용 도구들을 뜻합니다.  예) vi 등의 기본 편집기, cc나 gcc 등의 컴파일러, gdb 같은 디버거, ssh 같은 쉘과 그 쉘이 제공하는 ls, cd, ps, grep 등", "특권명령": "영어로는 privileged instruction 라 하며, 예) 입출력 관련 명령어, 인터럽트 관련 명령어, 특히 커널 모드/사용자 모드를 전환하는 모드 비트 자체를 변경시키는 명령어 등", "분할방법": "메모리공간을여러개로분할하는방법이다.", "동기식 호출": "블록킹콜이라고도 합니다. 예) read 같은 시스템 콜을 해 놓고 그 결과값이 넘어오기까지 기다린 후 read의 다음 라인으로 수행을 계속하는 것입니다.", "주소결속": "논리주소가물리주소로확정되는것이다.", "직접 입출력 방식": "직접 입출력 방식은 말그대로 CPU가 장치제어기 내의 자료 레지스터와 메모리 간의 자료 이동을 매번 직접 관장하는 것입니다. 이미 배운 바와 같이 CPU는 기본적으로 입출력 장치가 입출력을 하는 중에도 프로세스 수행을 할 수 있도록 되어 있지만 매 입출력시 인터럽트를 처리해야 하므로 부담이 될 수 있습니다. 따라서 이 방법은 입출력 발생의 시간 간격이 비교적 큰 문자장치, 가장 대표적으로 키보드를 들 수 있는데요, 우리가 흔히 부르는 시리얼 입출력 장치에 주로 사용합니다. ", "클럭 인터럽트": "특정 프로세스가 CPU를 과도하게 사용하는 것을 막기 위해 지정된 클럭 시간 간격으로 클럭 인터럽트가 실행되어, 지정된 시간 동안만 프로세스가 CPU를 사용할 수 있게 한다.", "인터럽트 방식": "대기방식인 폴링과 비교해서 굳이 표현하자면 알림방식이라 할 수 있겠습니다. 즉, CPU가 디바이스 드라이버의 코드를 수행함으로써 결국 입출력 명령을 장치제어기에 전송하고 CPU는 다른 프로세스를 수행 하고 있으면 그 요청했던 입출력 작업이 다 끝났다는 것을 장치제어기가 CPU에 알리는 것입니다.  여기서 이 알리는 것 자체를 인터럽트라고 부르는 것입니다. ", "컴파일시점결속": "컴파일러가물리주소를생성하는것이다.", "고정분할": "각메모리공간을고정된크기로나누는것이다.", "페이징": "페이지테이블을사용하여논리적공간을물리적공간으로대응시키는방법이다.", "폴링 방식": "CPU가 상태레지스터를 반복적으로 체크하면서 목표한 상태로 바뀌었는지를 체크하는 것입니다. 따라서 상태변화가 있을 때까지 대기하는 거나 다름없는거죠.", "명령레지스터": "장치에게 쓰기나 읽기 등의 동작을 명령하기 위한 명령코드를 적재하는 용도로 사용됩니다.", "부트스트래핑": "부트스트랩에서 나온 말로, 원래 부트스트랩이라는 것은 장화 뒤쪽에 달린 고리를 지칭하는 겁니다. 장화를 신을 때 장화에 달린 부트스트랩을 손으로 잡아 당겨 장화를 혼자 신을 수 있도록 도와주는 겁니다. 여기에서 개념이 확장되어 남의 도움 없이 자기가 직접 일을 한다는 의미를 갖게 된 것입니다. 운영체제라는 측면에서 볼 때 운영체제의 시동을 운영체제 일부 기능이 스스로 수행하는 과정을 뜻하는 용도로 사용되게 되었습니다.", "자료레지스터": "명령레지스터를 통해 명령한 동작을 실행하는 데에 있어서 오고갈 데이터를 읽고 쓰기 위한 일종의 버퍼 같은 용도로 사용됩니다.", "가변분할": "메모리전체를하나의연속된공간으로보고적절한위치에프로그램을적재해주는방식이다.", "외부단편화": "메모리중간에사용하지않는메모리때문에공간은충분하지만사용할수없는상황이다.", "모노리틱 커널": "원래 모노리틱 이라는 말이 하나라는 의미를 포함하고 있듯이 커널이 한 통으로 되어 있다라는 것인데, 다시 말해, 프로세스 관리, 메모리 관리, 파일시스템, 입출력 관리 및 네트워크 관리 등 모든 기능을 커널 내부에 포함하는 구조입니다. 그렇게 되면 효율성은 아주 높을 것이지만 다른 플랫폼으로의 이식성이나 확장성에 한계가 있기 마련입니다.", "페이지테이블": "페이징기법에서논리주소를물리주소로대응시키기위한주소변환테이블이다.", "다수준 인터럽트": "다양한 입출력 장치에서 인터럽트가 들어오게 되어 있습니다. 그렇게 되면 이러한 여러 종류의 인터럽트 간에 경쟁 내지는 충돌이 있을 수 있는데, 이를 조정하기 위하여 인터럽트 우선순위 수준 즉 interrupt priority level이 적용되게 되며, 이러한 수준이 여러 수준이 있을 것이므로 이를 다수준 인터럽트 시스템이 부르기도 합니다", "가상메모리": "프로그램에실제메모리주소가아닌가상의메모리주소를주는방식이다."}